# Mo公共许可证(Mo Public License 缩写为MoPL)
版权所有 © 2026 `MoAEIOU` 联系方式 : <me@867678.xyz>

MoPL以滚动方式更新 时刻以<https://github.com/moaeiou/moaeiou/blob/main/LICENSE>显示的最新版本为准

MoPL是一个简短的自由软件许可
# 协议内容
为了避免翻译所带来的问题（那需要双语律师并且很麻烦）这里使用中文（简体）进行判定
## 免责声明
- 软件按“原样(AS IS)”提供，不带有任何明示或暗示的担保
- 原作者不对因使用软件产生的任何直接或间接损失承担责任
## 授权对象
- 只要使用了MoPL的项目都要遵守MoPL 不论你是人类、AI或是猫狗
## 传染性
- 使用MoPL的项目在二次分发时必须以任何形式附上MoPL
- 修改使用了MoPL的项目时也要遵循MoPL
- 其他项目如果使用MoPL授权的任何东西都需要以MoPL或其他强传染性许可
如GNU GPL/AGPL 授权

## 您拥有以下权利：
- 出于任何目的运行软件
- 研究该软件如何运行
- 随意复制和再分发
## 以下权利将受到限制：
- 修改或发布改进版本 您可以修改原软件，但您只有两种方式
1.修改后并入主线

2.改一个完全不同的名称并清晰的标注不是原软件
## 您没有下列权利：
- 将修改过的软件与原版混淆 或容易引起误导的方式传播、分发修改版
- 将原作者抹去
例如：我开发了一个项目，被别人看见说成是他开发的
